{"meta":{"title":"Cheeper.io","subtitle":null,"description":null,"author":"Cheeper.io","url":"https://cheeper.io/blog"},"pages":[],"posts":[{"title":"Xbox Scorpio - The Next Generation Game Console","slug":"Xbox-Scorpio-The-Next-Generation-Game-Console","date":"2017-02-05T09:03:15.000Z","updated":"2017-02-05T10:32:48.930Z","comments":true,"path":"2017/Xbox-Scorpio-The-Next-Generation-Game-Console/","link":"","permalink":"https://cheeper.io/blog/blog/2017/Xbox-Scorpio-The-Next-Generation-Game-Console/","excerpt":"Microsoft plans to release their next generation game console - Xbox Scorpio (people call it Xbox S) on holiday season of 2017, let’s see how this console would blow your mind… Compare Xbox One S prices on Cheeper.io","text":"Microsoft plans to release their next generation game console - Xbox Scorpio (people call it Xbox S) on holiday season of 2017, let’s see how this console would blow your mind… Compare Xbox One S prices on Cheeper.io Official Preview of Xbox Scorpio Xbox Scorpio is built for VR Microsoft HoloLens Game: Fragments Xbox Scorpio won’t just be a machine capable of playing games in VR, it’ll be built for VR, Xbox team taking VR integration very seriously, they are working closely with Oculus from the early days of Xbox Scorpio, and of course, Microsoft HoloLens would be also integrated with Scorpio. And in the announcement of Scorpio, Fallout 4 VR was clearly mentioned that would be released on Scorpio platform. Scorpio’s Performance Would be InsaneXbox Scorpio will have an 8-core CPU and a graphics card with 6TFLOPs (trillion floating point operations per second) of power which almost same as today’s top-end graphic card Nvidia GeForce GTX 1070. It will also have 320GB/sec of memory bandwidth Scorpio is 4K-ready As we know Xbox One S supports a lite version of 4K gaming. Scorpio would be very first game console that fully support 4K gaming which means it could easily run 4K games at 60Hz.","categories":[{"name":"Previews","slug":"Previews","permalink":"https://cheeper.io/blog/categories/Previews/"}],"tags":[{"name":"Xbox","slug":"Xbox","permalink":"https://cheeper.io/blog/tags/Xbox/"},{"name":"Game","slug":"Game","permalink":"https://cheeper.io/blog/tags/Game/"},{"name":"Scorpio","slug":"Scorpio","permalink":"https://cheeper.io/blog/tags/Scorpio/"}]},{"title":"Best Ultrabook? Lenovo Yoga 910 Reviews","slug":"Best-Ultrabook-Lenovo-Yoga-910-Reviews","date":"2017-02-03T04:37:04.000Z","updated":"2017-02-03T08:42:12.410Z","comments":true,"path":"2017/Best-Ultrabook-Lenovo-Yoga-910-Reviews/","link":"","permalink":"https://cheeper.io/blog/blog/2017/Best-Ultrabook-Lenovo-Yoga-910-Reviews/","excerpt":"Lenovo released their latest 2-in-1 ultrabook Yoga 910 with big wow features like watchband hinge and fingerprint security, Yoga 910 also offer a nearly-bezel-free 13.9-inch display that gives you more to look at without taking up extra space. Its battery life also has seen a pretty big increase and will now last 10.5 hours on a charge. Now the price has down to $1049 compare to the original price at $1329 Compare Yoga 910 prices on Cheeper.io","text":"Lenovo released their latest 2-in-1 ultrabook Yoga 910 with big wow features like watchband hinge and fingerprint security, Yoga 910 also offer a nearly-bezel-free 13.9-inch display that gives you more to look at without taking up extra space. Its battery life also has seen a pretty big increase and will now last 10.5 hours on a charge. Now the price has down to $1049 compare to the original price at $1329 Compare Yoga 910 prices on Cheeper.io Overview Specs CPU 2.7-GHz Intel Core i7-7500U Operating System Up to Windows 10 Home Graphics Intel HD graphics 620 Memory Up to 16 GB DDR4 2133 MHz Storage Up to 1 TB PCIe SSD Webcam / Microphone 720p with dual array microphone Audio 2 x JBL stereo speakers with Dolby Audio™ Premium Battery Up to 9 hours with local video playback Display 13.9” FHD IPS Multi-touch (1920x1080) with integrated camera13.9” UHD IPS Multi-touch (3840x2160) with integrated camera Material Aluminum Dimensions (W x D x H) (inches) : 12.72 x 8.84 x 0.56(mm) : 323 x 224.5 x 14.3 Weight Starting at 3.04 lb (1.38 kg) Special Features Yoga watchband hingeUnibody metal design3-sided narrow display bezelFingerprint securityBacklight keyboard Ports USB 3.0 Type-C with video-outUSB 2.0 Type-C with chargingUSB 3.0 with always-on chargingAudio combo jack New Designed Signature Watchband HingeSince Yoga 900 seriers, Lenovo re-designed their signature watchband hinge, as Kevin Beck said on Lenovo’s Blog: There is an incredible amount of design and engineering that went into inventing this attractive little feature. While its design may look simple, the engineering behind it definitely is not. In fact, it took years to innovate and continually refine the YOGA 900S hinge to what it is today. This new classy, sophisticated hinge that puts the Yoga 910 on the short list of the best-looking laptops on the market 13.9-Inch 4K ScreenThanks to Yoga 910’s smaller-bezel design, the screen size increased almost 10 percent than those on 13.3-Inch systems, with this large beautiful 4K screen, Yoga 910 would be the first choice of your entertainment laptop in 2017. High Performance for Gaming &amp; WorkingWith 2.7-GHz Intel Core i7 7500U CPU, 8GB RAM and a 256GB SSD, Yoga 910 makes it much faster and more power efficient. It beat the Yoga 900 on the 3DMark Cloud Gate (6,815) and Fire Strike Extreme (425) tests, while both scores can be considered playing major 3D games smoothly.","categories":[{"name":"Reviews","slug":"Reviews","permalink":"https://cheeper.io/blog/categories/Reviews/"}],"tags":[{"name":"Laptop","slug":"Laptop","permalink":"https://cheeper.io/blog/tags/Laptop/"},{"name":"Lenovo","slug":"Lenovo","permalink":"https://cheeper.io/blog/tags/Lenovo/"},{"name":"Yoga","slug":"Yoga","permalink":"https://cheeper.io/blog/tags/Yoga/"}]},{"title":"Most Anticipated Phones of 2017","slug":"most-anticipated-phones-of-2017","date":"2017-01-26T02:40:19.000Z","updated":"2017-01-26T09:14:24.024Z","comments":true,"path":"2017/most-anticipated-phones-of-2017/","link":"","permalink":"https://cheeper.io/blog/blog/2017/most-anticipated-phones-of-2017/","excerpt":"Now we are officially entered in 2017, The speed of mobile phone replacement become faster and faster, what phones we could expect in 2017? Let’s see the five most anticipated phones in 2017, which one is better, which one is more suitable for you? Hope this article could help you to make a decision.","text":"Now we are officially entered in 2017, The speed of mobile phone replacement become faster and faster, what phones we could expect in 2017? Let’s see the five most anticipated phones in 2017, which one is better, which one is more suitable for you? Hope this article could help you to make a decision. Apple iPhone 8/8S The year of 2017 is the ten anniversary of Apple’s iPhone, the outside world agreed that Apple will make the largest upgrading for iPhone in its history. The next version of iPhone may be called iPhone 8/8s, but it is also possible to use a new version name. the upgrade may include the use of new glass shell appearance, AMOLED hyperboloid screen, wireless charging, super dual camera and so on. There is a little chance that Apple may also release iPhone 7S in 2017, but based on past experiences, Apple won’t release two flagship phones at same year. Samsung Galaxy S8/S8 Edge/Note 8 The era of smartphone technology creators have long been more than just Apple, Samsung’s hyperbolic screen is the most successful invention in 2016, at the same time, Samsung is also taking the lead of camera technology in the entire smartphone industry. Due to the current Samsung phones still not use dual camera, and the industry which either Apple or various international and domestic manufacturers have taken the dual camera, so it is worth to look forward the new Galaxy phones integrate dual camera, in addition, because of the obvious problems of Note 7, the S Pen and iris recognition features has also been delayed, and those features may add into the new Note 8. Huawei P10/Mate 10 2016 is a successful year for Huawei P9 and Mate 9, the best selling point is Leica’s dual camera. In 2017, beside dual camera, Huawei P10/Mate 10 would also integrate hyperbolic screen and ultrasonic fingerprint identification technology, and P10/Mate 10 would use most recent release Kirin 970 CPU. Last year, Mate 9 also launched a special version of cooperation with Porsche, Mate 10 is expected to continue this strategy. ASUS ZenFone AR The quality of ASUS ZenFone seriers has been well recognized, every year ASUS will also launch new models with numerous new characteristics, last year, ASUS has a very good cooperation relationship with Qualcomm, this year ZenFone AR would also be built with SnapDragon 835 CPU. On this year’s CES, ASUS first introduced ZenFone AR, from their poster, ZenFone AR would support dual camera and AR (the second phone in the world to support Google Tango). OnePlus 4 OnePlus phones has been well-known by the high performance and low-cost, the 2017 flagship OnePlus 4 may be equipped with the latest Qualcomm SnapDragon 835 CPU and 8G memory, and the price may lower than $500.","categories":[{"name":"Previews","slug":"Previews","permalink":"https://cheeper.io/blog/categories/Previews/"}],"tags":[{"name":"Apple","slug":"Apple","permalink":"https://cheeper.io/blog/tags/Apple/"},{"name":"Phone","slug":"Phone","permalink":"https://cheeper.io/blog/tags/Phone/"},{"name":"Samsung","slug":"Samsung","permalink":"https://cheeper.io/blog/tags/Samsung/"},{"name":"Huawei","slug":"Huawei","permalink":"https://cheeper.io/blog/tags/Huawei/"},{"name":"ASUS","slug":"ASUS","permalink":"https://cheeper.io/blog/tags/ASUS/"},{"name":"OnePlus","slug":"OnePlus","permalink":"https://cheeper.io/blog/tags/OnePlus/"}]},{"title":"New MacBook Pro vs Dell XPS 15","slug":"New-MacBook-Pro-vs-Dell-XPS-15","date":"2017-01-25T07:49:11.000Z","updated":"2017-01-26T02:13:54.576Z","comments":true,"path":"2017/New-MacBook-Pro-vs-Dell-XPS-15/","link":"","permalink":"https://cheeper.io/blog/blog/2017/New-MacBook-Pro-vs-Dell-XPS-15/","excerpt":"The Dell XPS 15 and the MacBook Pro are both excellent computers. It often is said that the two are so close in terms of quality that it’s difficult to say which is better. However, they each have their own benefits and drawbacks.","text":"The Dell XPS 15 and the MacBook Pro are both excellent computers. It often is said that the two are so close in terms of quality that it’s difficult to say which is better. However, they each have their own benefits and drawbacks. Pros Of The MacBook Pro MacBook Pro Security: The MacBook Pro uses a Mac Sierra operating system, which tends to be more secure than the Windows 10 used by the Dell XPS15. While macintosh operating systems are not completely immune to malware, they are far more malware resistant than Windows. The MacBook Pro’s Built In Voice Assistant: The MacBook Pro comes with Siri. While the Dell XPS15 offers Cortana, Siri is much more reliable. Additionally, Siri does not track your voice search history like Cortana. Your voice searches with Siri aren’t saved with your IP address, name, or any personally identifying information. The Touch Screen: The MacBook Pro touch screen is one of the best on the market. Many have said that the experience of using the MacBook Pro is like combining an iPhone with a laptop. Despite there being a touchscreen, there also is a quality keyboard to use. While it’s possible to get a touchscreen on a Dell XPS 15, the MacBook Pro is of better quality. Cons Of The MacBook Pro Less Ports: The MacBook Pro doesn’t have anywhere near the number of ports as the Dell XPS 15. This means that it’s not as easy to connect other devices to it. Price: The MacBook Pro will cost you at least $1499 from Apple. If you get the touchscreen, the price rises to $1999. You could check &amp; compare Macbook Pro prices here. A Small Number Of Games Available: There are relatively few games run on a Mac Sierra operating system. While there are some, you’re likely to have a much harder time finding a game that you like. Pros Of Dell XPS 15 Quality Gaming Experience: If you’re a fan of PC games, you’ll definitely want a Windows operating system. The Dell XPS 15 comes with Windows 10. This operating system will allow you to play an exceptionally wide range of games, and you’ll be able to stream games from your Xbox One or PlayStation 4 to your laptop! There are even some Windows 10 games available for free. It’s Environmentally Friendly: The Dell XPS 15 is particularly environmentally friendly. Many computers have toxic metals inside them, but the Dell XPS 15 is designed without mercury and other toxic metals. Battery Life: The Dell XPS 15 potentially can have a somewhat longer battery life than the MacBook Pro. The MacBook Pro has a battery that holds 49.2 watt hours, but the Dell XPS 15 has a battery that holds 60 watt hours. The difference is not that large, but it can make a difference. However, this advantage is eliminated if you get the Dell XPS 15 with a touchscreen. If you get a touchscreen, the battery tends not to last as long as the MacBook Pro. Higher Resolution: The Dell XPS 15 features excellent graphics. In fact, the resolution on the Dell XPS 15 is 3200 x 1800 pixels as opposed to the MacBook Pro’s 2,560 x 1,600 pixels. It even is possible to pay extra to get the Dell XPS 15 with QHD+. This will result in even better graphics More Advanced Processor: The processor on the Dell XPS 15 uses a 7th Generation Intel Core processor. However, the MacBook Pro runs on a 6th Generation Intel Core Processor. High Resolution Webcam: The Dell XPS 15 has a higher resolution webcam than the MacBook Pro. The webcam on the Dell XPS 15 has a resolution of 720p. This is far more than the MacBook Pro’s webcam resolution of 480p. Cons Of The Dell XPS 15 Inaccurate Colors On The Webcam: The Dell XPS 15 webcam doesn’t show colors as they are. Instead, the colors tend to be a bit over-saturated. Lower Quality Audio: While the graphics on the Dell XPS 15 are excellent, the audio isn’t anywhere near this level of quality. However, the MacBook Pro offers higher quality audio. If you listen to music a lot, this can be a reason to choose the MacBook Pro over the Dell XPS 15. Lower Hard Drive Speed: Copying and moving files can take longer with the Dell XPS 15 than the MacBook Pro. The hard drive tends to run substantially slower. On the MacBook Pro, the hard drive speed averages 355.9 mb/s. However, the hard drive on the Dell XPS 15 averages at just 231.33 mb/s. This figure is even slower if you use a Dell XPS 15 with a touchscreen.","categories":[{"name":"Reviews","slug":"Reviews","permalink":"https://cheeper.io/blog/categories/Reviews/"}],"tags":[{"name":"Laptop","slug":"Laptop","permalink":"https://cheeper.io/blog/tags/Laptop/"},{"name":"MacBook","slug":"MacBook","permalink":"https://cheeper.io/blog/tags/MacBook/"},{"name":"XPS15","slug":"XPS15","permalink":"https://cheeper.io/blog/tags/XPS15/"},{"name":"Dell","slug":"Dell","permalink":"https://cheeper.io/blog/tags/Dell/"},{"name":"Apple","slug":"Apple","permalink":"https://cheeper.io/blog/tags/Apple/"}]},{"title":"The Five Cameras Worth to Have","slug":"The-five-cameras-worth-to-have","date":"2017-01-24T09:54:16.000Z","updated":"2017-01-26T02:14:34.953Z","comments":true,"path":"2017/The-five-cameras-worth-to-have/","link":"","permalink":"https://cheeper.io/blog/blog/2017/The-five-cameras-worth-to-have/","excerpt":"Although manufactures release new cameras every year, but most of the latest features are nothing more than a gimmick, how many times the new feature you used after bought a new camera? Maybe once?Many photographers still taking pictures with a camera purchased many years ago.Equipment is not the whole story of photographing, A right camera is much important than a feature-riched camera. In this post, we introducing five cameras deserved to buy, some of them may not have latest hi-tech features, but each one of them is beautifully finished off, and could be used in a long life cycle.","text":"Although manufactures release new cameras every year, but most of the latest features are nothing more than a gimmick, how many times the new feature you used after bought a new camera? Maybe once?Many photographers still taking pictures with a camera purchased many years ago.Equipment is not the whole story of photographing, A right camera is much important than a feature-riched camera. In this post, we introducing five cameras deserved to buy, some of them may not have latest hi-tech features, but each one of them is beautifully finished off, and could be used in a long life cycle. Canon EOS 5D Mark IV Shutterbugs won’t feel strange about 5D seriers, as Canon’s high-end camera model, it’s fourth edition (Mark IV) released in the middle of 2016, and it has been four years and a half since Mark III released, in fact, even if the Mark IV came out, Mark III and Mark II are still thehis hot well cameras in market, and Mark IV will not be out of date for a long time since there is no clue when Mark V would be released. 5D Mark IV exceeded 30 million pixels, also joined with 4K video recording, GPS, Wi-Fi, Dual Pixel and other functions, many people even use this camera to make a movie. Pentax K-1 You may not very familiar with this brand, but never underestimate this camera. K-1 has won the most favorite camera in a Japanese photographers’ survey, Pentax was a big name in traditional film era, their film camera can be said to be a classic memory of the times. As early as in 2000, Pentax has announced the development of a full frame SLR, and after 16 years, Pentax finally released their very first SLR camera K-1. Sony A7R Mark II The A7 seriers has been a legend since the date of it released, A7 camera has a lot of hardcore fans, but also got lots of people who hate it. A7R Mark II pushed the A7 seriers to the peak, and has been widely acclaimed high scores in various camera websites and forums. Nikon D500 If you have a limited budget, you may not need a full frame camera, there are plenty of great residual amplitude cameras could be considerred, such Nikon D500. A lot of configurations and specifications of D500 are very similar to Nikon’s high-end camera D5, but the price is much lower than D5. Ricoh GR GR APS-C format digital camera just launched two generations, but this model has a history of more than 20 years, and the first generation of Ricoh GR released on 1996. Ricoh GR has a great reputation in professional photographers, for example, Japanese famous photographer Daido Moriyama use GR21 as his daily camera. Compared to GR1, GR2 has no substantial upgrades, just add Wi-Fi and NFC, and slightly increased the battery volumn. Thanks to the well design, GR camera became a very handy camera, it could be put in pocket and fully operated by single hand, if you’re a street photographer, this camera must be a good choice.","categories":[{"name":"Top 5s","slug":"Top-5s","permalink":"https://cheeper.io/blog/categories/Top-5s/"}],"tags":[{"name":"Camera","slug":"Camera","permalink":"https://cheeper.io/blog/tags/Camera/"},{"name":"Canon","slug":"Canon","permalink":"https://cheeper.io/blog/tags/Canon/"},{"name":"Pentax","slug":"Pentax","permalink":"https://cheeper.io/blog/tags/Pentax/"},{"name":"Sony","slug":"Sony","permalink":"https://cheeper.io/blog/tags/Sony/"},{"name":"Nikon","slug":"Nikon","permalink":"https://cheeper.io/blog/tags/Nikon/"},{"name":"Ricoh","slug":"Ricoh","permalink":"https://cheeper.io/blog/tags/Ricoh/"}]},{"title":"The 5 Best Gaming Desktops under $500 in 2016","slug":"The-5-Best-Gaming-Desktops-under-500-in-2016","date":"2017-01-23T12:04:03.000Z","updated":"2017-01-26T02:14:18.524Z","comments":true,"path":"2017/The-5-Best-Gaming-Desktops-under-500-in-2016/","link":"","permalink":"https://cheeper.io/blog/blog/2017/The-5-Best-Gaming-Desktops-under-500-in-2016/","excerpt":"1.CybertronPC Borg-Q Gaming Desktop Price: $499 CPU: 3.8 GHz AMD FX Graphics: NVIDIA GeForce GT610 1GB Hard Drive: 1000 GB SATA II Memory: 8 GB DDR3 Free Lifetime Technical Support CybertronPC Borg-Q could be the most popular gaming desktop under $500 in 2016. The price was so wonderful for its ability as a ready-to-go desktop. Thanks to NVIDIA GeForce GT610 and 8GB memory, it would run most of recent released games with clear, vibrant graphics.","text":"1.CybertronPC Borg-Q Gaming Desktop Price: $499 CPU: 3.8 GHz AMD FX Graphics: NVIDIA GeForce GT610 1GB Hard Drive: 1000 GB SATA II Memory: 8 GB DDR3 Free Lifetime Technical Support CybertronPC Borg-Q could be the most popular gaming desktop under $500 in 2016. The price was so wonderful for its ability as a ready-to-go desktop. Thanks to NVIDIA GeForce GT610 and 8GB memory, it would run most of recent released games with clear, vibrant graphics. 2.CybertronPC Electrum QS-A6 Price: $439 CPU: AMD A6-7400K 3.50GHz Dual-Core Graphics: AMD Radeon R5 GPU Hard Drive: 1000 GB SATA II Memory: 16 GB DDR3 Free Lifetime Technical Support Another Cybertron PC with great performance and low cost. 16GB memory and AMD Radeon R5 are the biggest selling points. This computer is definitely starting point to PC gaming. 3.Alienware Steam Machine ASM100-6980BLK Price: $462 CPU: 2.2 GHz Intel Core i7 Graphics: Nvidia GeForce GTX GPU Hard Drive: 1GB SATA Memory: 8 GB DDR3L SDRAM This is not a general purpose PC, it is designed for huge gamers powered by Steam, and every Alienware Steam Machine includes free games as well as exclusive downloadable content for Alienware customers. 4.Lenovo Ideacentre Price: $499 CPU: Intel Quad-Core i5-4460s Graphics: Intel HD graphics 4600 Hard Drive: 2-in-1 hybrid hard drive 2TB 7200 rpm SATA Hard Drive + 8GB Solid State Drive Memory: 16GB DDR3L 1600MHz SDRAM Although Lenovo Ideacentre comes with a less performance graphics card which compared to previous PCs, the 8GB SSD and Quad-Core CPU would handle most of games without a blink. 5.CybertronPC Electrum QS-GT7 Price: $479 CPU: AMD FX-4300 3.80GHz Quad-Core Graphics: Nvidia GeForce GT 730 Hard Drive: 1000 GB SATA II Memory: 8 GB DDR3 Lifetime Technical Support If you are a gamer but not always play most recent games, this computer would exceed your expectations. It could run most of popular online games (WoW, StarCraft, Overwatch etc) in full graphic settings smoothly.","categories":[{"name":"Top 5s","slug":"Top-5s","permalink":"https://cheeper.io/blog/categories/Top-5s/"}],"tags":[{"name":"Lenovo","slug":"Lenovo","permalink":"https://cheeper.io/blog/tags/Lenovo/"},{"name":"Desktop","slug":"Desktop","permalink":"https://cheeper.io/blog/tags/Desktop/"},{"name":"Gaming","slug":"Gaming","permalink":"https://cheeper.io/blog/tags/Gaming/"},{"name":"Alienware","slug":"Alienware","permalink":"https://cheeper.io/blog/tags/Alienware/"},{"name":"CybertronPC","slug":"CybertronPC","permalink":"https://cheeper.io/blog/tags/CybertronPC/"}]},{"title":"Google Pixel Reviews","slug":"google-pixel-reviews","date":"2017-01-20T00:32:32.000Z","updated":"2017-01-26T02:13:33.378Z","comments":true,"path":"2017/google-pixel-reviews/","link":"","permalink":"https://cheeper.io/blog/blog/2017/google-pixel-reviews/","excerpt":"For many cell phone enthusiasts, Nexus phone has been a belief-like existence: high perfomance with low-cost, authentic Android experience, all of these make Nexus a must-have phone in Android’s world.","text":"For many cell phone enthusiasts, Nexus phone has been a belief-like existence: high perfomance with low-cost, authentic Android experience, all of these make Nexus a must-have phone in Android’s world. However, all this eventually become memories - Google decided end the Nexus series on 2016, and created new signature series and named it Pixel. Prior to the Nexus phone has been the foundry to provide design solutions, Google is responsible for changes and additions, so we can find the Nexus phone on behalf of the various foundries.This year’s Pixel mobile phone designed entirely by Google itself, on behalf of the industry is only responsible for the production and assembly of HTC, which is very similar to the relationship between Apple and Foxconn. This time you can only find one capital “G” on the back of pixel phone, and no traces of the foundry, which also marks Google officially enter cellphone hardware industry. Pixel / Pixel XL are equipped with: Snapdragon 821 CPU 4GB memory 12.3 million pixel camera 32GB/128GB storage And Google Pixel has 5-inch 1080P screen and 2770mAh battery; On the other hand Pixel XL has 5.5-inch 2K screen and 3450mAh battery. Both support fast charge, and Google marketing them for 15 minutes charging can use 7 hours. On Google Store, the official price of Pixel was from $649 with free shipping. On Amazon, the price was from $550, and you could check a full price comparison list on our website","categories":[{"name":"Reviews","slug":"Reviews","permalink":"https://cheeper.io/blog/categories/Reviews/"}],"tags":[{"name":"Google","slug":"Google","permalink":"https://cheeper.io/blog/tags/Google/"},{"name":"Pixel","slug":"Pixel","permalink":"https://cheeper.io/blog/tags/Pixel/"},{"name":"Android","slug":"Android","permalink":"https://cheeper.io/blog/tags/Android/"},{"name":"Phone","slug":"Phone","permalink":"https://cheeper.io/blog/tags/Phone/"}]}]}