{"meta":{"title":"Cheeper Blog","subtitle":null,"description":"The latest consumer electronics reviews, previews and news, covering laptops, desktops, smartphones, cameras, gadgets, games and more.","author":"Cheeper.io","url":"https://cheeper.io/blog"},"pages":[],"posts":[{"title":"Nintendo Switch Reviews in Depth 2017","slug":"Nintendo-Switch-Reviews-in-Depth-2017","date":"2017-03-13T08:41:29.000Z","updated":"2017-03-13T10:03:18.337Z","comments":true,"path":"2017/Nintendo-Switch-Reviews-in-Depth-2017/","link":"","permalink":"https://cheeper.io/blog/blog/2017/Nintendo-Switch-Reviews-in-Depth-2017/","excerpt":"The long-awaited Nintendo Switch has been officially launched on Mar 2017, together with the more exciting new game “Zelda legend: the wilderness of interest”. Nintendo said Switch would combine the convenience of handheld consoles with the powerful features of TV consoles. Although in order to achieve the full integration of portability and functionality, Nintendo had made some compromises, people believe Switch can be achieved “one plus one greater than two” effect once more games released.","text":"The long-awaited Nintendo Switch has been officially launched on Mar 2017, together with the more exciting new game “Zelda legend: the wilderness of interest”. Nintendo said Switch would combine the convenience of handheld consoles with the powerful features of TV consoles. Although in order to achieve the full integration of portability and functionality, Nintendo had made some compromises, people believe Switch can be achieved “one plus one greater than two” effect once more games released. Nintendo’s CounterattackSwitch is perhaps Nintendo’s last straw. Today, Sony and Microsoft are the two most competitive companies in the field of TV game consoles. Nintendo never want to join the competition again after the Wii U’s waterloo. In response to this situation, Nintendo put forward a very cohesive and very intelligent solution - Switch, although this program still has its short board. As a home TV console, Switch can directly compete with PlayStation 4 and Xbox One at some level. On the other hand, as a handheld device, it also outperform existing mobile systems and smartphones. Nintendo tried to please everyone, this is nothing more than a gamble, and the more you think about it, the more you think this may be the only gambling that Nintendo can do. Sony PlayStation 4Buy it on Amazon.com Microsoft Xbox OneBuy it on Amazon.com Nintendo Switch Game Playing Specs Screen 6.2-inch LCD touchscreen (1280 x 720) Resolution Up to 1080p 60fps when plugged into a TV CPU Nvidia Tegra processor Storage 32GB storage Bluetooth Bluetooth 4.1 (on tablet)Bluetooth 3.0 (in Joy-Cons) Audio Stereo speakers (on tablet)PCM 5.1 channel audio in TV mode USB USB Type-C port (on tablet)3x USB 2.0 ports (on dock) Battery 4,310mAh battery (on tablet)525mAh batteries (in Joy-Cons) Dimensions (WxHxD) 4.6 x 2.7 x 1.5” / 116.8 x 68.6 x 38.1 mm Weight 22.12 oz / 627 g with battery and memory card So What is Nintendo Switch?The main body of Switch consists of a Kindle-sized tablet computer (Nintendo called “host”). It providing two game modes, when the host is connected to the TV through the Dock base, it is like a regular game console, two small wireless handles (called “Joy-Con R” and “Joy-Con L”) can be used independently or separately. When you want to go out, just take the host out of the Dock - the game will continue and display on the built-in screen immediately, it is not running through the cloud video stream, nor is it a lite mobile version - it is exactly the same game that runs on the same hardware, just the screen is different. You can put the handles on both sides of the tablet, turn it into a single device. Switch can also be connected wirelessly for up to 8 people to play the game together, although we have not had the opportunity to test this play. Nintendo SwitchBuy it on Amazon.com Let’s take a look at the detailsSwitch host itself is about 21 cm wide and 10 cm wide and 1.2 cm thick - the size is probably equivalent to Kindle or small tablet computer. And then look at the handles, it is not unfounded that a lot of people compare the handles with the Wii U’s handles, but the difference is more like the difference between day and night. Wii U handle is like a children’s music toys. At the same time, Switch’s handle feels like a high-end smartphone: thin, well-done, very solid. Many of the features we are familiar with are focused on the Switch edge: power, volume, cassette, Micro SD card slot, bottom speakers, and top cooling holes. Switch on both sides looks a bit rough, because it is precisely the two handles into the slide. The game is installed in the SD card inside, can be directly inserted into the upper right corner of the Switch. Read and load the game time is very fast, giving the impression of a blink of an eye to complete. Switch can be inserted into the Dock base, switch to the host mode. Dock base is made of plastic, looks very light, Dock base also can be easily shaked, once accidentally twisted, Switch host will certainly fly out. To be honest, this thing is definitely not worth $90. It is a pleasant experience to slide the Joy-Con handle on both sides of the flat panel. They can not only slide along the slide safely and accurately, and one end will be issued a crisp click, but also accompanied by the flat panel host bite together sound effects, the screen will show the handle has been installed in place. After the combination is complete, the entire host is very tight, there is no signs of loosening. The battery life of Switch is depend on which game you are playing. In the maximum brightness, I played the “Legend of Zelda” about two and a half hours. Joy-Con handle battery life is up to 20 hours. Nintendo SwitchBuy it on Amazon.com ConclusionNintendo has been successful in Switch design. Switch is well produced and easy to play. Now the problem is that the games running on Switch is not much. Personally, I not only hope that Switch will be a platform with a small number of independent brand games, but also become a suitable for lightweight independent games and innovative mobile cross-border game development platform. For a child, Switch is a good product for people who are often outside, as well as players who do not have time or do not want to sit down on the big screen to play games. Nintendo and its partners will be able to survive, Switch will eventually become a must-have game console, like Xbox, PlayStation, mobile phones, PC and other types of game equipment sold on the market.","categories":[{"name":"Reviews","slug":"Reviews","permalink":"https://cheeper.io/blog/categories/Reviews/"}],"tags":[{"name":"Game","slug":"Game","permalink":"https://cheeper.io/blog/tags/Game/"},{"name":"Nintendo","slug":"Nintendo","permalink":"https://cheeper.io/blog/tags/Nintendo/"},{"name":"Switch","slug":"Switch","permalink":"https://cheeper.io/blog/tags/Switch/"}]},{"title":"Best Affordable 4K Cameras in 2017","slug":"Best-Affordable-4K-Cameras-in-2017","date":"2017-02-21T10:07:26.000Z","updated":"2017-02-22T13:21:24.796Z","comments":true,"path":"2017/Best-Affordable-4K-Cameras-in-2017/","link":"","permalink":"https://cheeper.io/blog/blog/2017/Best-Affordable-4K-Cameras-in-2017/","excerpt":"We all know 4K era is coming, If you take a look at those cameras released in 2016, no surprise that all major camera manufacturers have implemented 4K shooting somewhere in their lines. And most excitingly, in 2017, you would see this feature not only on high end cameras, but also on mid lower end. So, no matter how much budget you have, it’s likely you can afford a camera with 4K video in 2017.","text":"We all know 4K era is coming, If you take a look at those cameras released in 2016, no surprise that all major camera manufacturers have implemented 4K shooting somewhere in their lines. And most excitingly, in 2017, you would see this feature not only on high end cameras, but also on mid lower end. So, no matter how much budget you have, it’s likely you can afford a camera with 4K video in 2017. Although most of new released cameras came with 4K shooting feature, doesn’t mean to say they’re same. Actually 4K cameras could perform quick differently with different structures and configurations. Even something as simple as whether the camera uses the full width of the sensor is vital to consider, as this has a significant effect on your effective angle of view, not to mention other features we have to consider such as focus peaking, zebra patterning and log profiles. In this post, we first gave a brief introduction on 4K video and 4K video camera, then, we’ve rounded up the top affordable 4K cameras on market right now, and list why they’ve stand out from the rest. What Is 4K Video?A 4K video is a video with 4K resolution, refers to horizontal resolution on the order of 4,000 pixels and vertical resolution on the order of 2,000 pixels. There are two main 4K resolution standards: The DCI 4K resolution standard, which has a resolution of 4096 × 2160 pixels (256:135, approximately a 1.9:1 aspect ratio). This standard is widely respected by the film and video production industry. The other one is called UHD-1, or ultra-high-definition television (UHDTV), is the 4K standard for television and computer monitors. Many manufacturers may advertise their products as UHD 4K, or simply 4K, when the term 4K is traditionally reserved for the cinematic, DCI resolution. This often causes great confusion among consumers. Do I Need a 4K Video Camera?Although the jump from 1080p to 4K isn’t as obvious as SD to HD was, you still have many benefits if you use a 4K video camera. And the benefits of shooting in 4K will growth in the future as 4K video does become a norm. Sharper 4K footageNowadays, most HD cameras will shoot in 1080p (the highest level of HD footage) but there is no regulation at all on a camera’s bit-rate, some low end cameras typically output HD footage at a relatively low bit-rate. This causes your footage to look soft, pixelated, and even blurred. On the other side, a 4k video is approximately the size of 4 standard 1080p videos. Shrinking down 4k footage to be 1080p is a night and day difference in detail and quality. So, even you don’t have a 4K output equipment, shooting 4k video footage and down-sampling to get a sharper 1080p final export can also help cut down on noise and grain making the footage appear to be cleaner as well. Perfect Pans and ZoomsIt’s almost impossible to film a perfectly smooth pan with a regular video camera, it’s also literally impossible to film a perfectly smooth zoom with a manual lens. However, If you shoot 4k, small pans and zooms have never been easier. Simply zoom out, grab a few seconds of your scene and then add a pan or a zoom once you get back to the computer. Adding these movements to your video in post will actually look better than anything you can do in the field and because 4k gives you so many extra pixels to work with, your finished product will look flawless. Good For CroppingAs videos are sets of still images, the same technical operations apply to them as well. If you want to re-crop your picture a higher resolution camera might be of help. You can do that on a 2K camera as well, although it will result in a less than 2K frame. Slightly upscaling a video won’t be much noticeable. Say, you cropped a 16:9 1920 pixels video to a 16:9 1800 pixels. Resizing it back to 1920 won’t be so bad as quality. For example “Whiplash” uses footage from ARRI Alexa (2.8K) and Canon 7D (HD) and the final content is delivered in 2K. Visual EffectsBigger video frames can be useful for incorporating parts of them in visual effects. An example of that is the Queen of Hearts in the Alice movies. The way they made her head bigger is composing her head on top of the original footage. They used the same footage for the head, masking it out, but it was slightly enlarged. In order to deliver high quality footage in 2K they shot these in 4K. This way they did not have to upscale the head but resize the original footage slightly down and have the “head footage” in original resolution. How to choose a 4K camera MirrorlessWe recommend mirrorless cameras unless you are a keen photographer. Mirrorless cameras are one of the cheapest ways to buy a 4K camera. Generally priced between $500 – $1500, they take high quality pictures and 4K video recording is excellent. DSLRDSLR allows a camera with interchangeable lenses and a viewfinder, almost all professional sports, press and wildlife photographers choose full-frame DSLRs over every other camera type, not many DSLR cameras film in 4K, and even DSLR camera is much expensive than mirrorless camera. Battery lifeBattery life is related important for a recording camera, there are many types of battery. Your digital camera might be using disposable batteries or maybe it uses rechargeable ones. When it comes to power consumption not all digital camera features are equal. Some of the digital camera greatest features are high energy consumers. The biggest energy consumers in a digital camera are the LCD screen and the motors that move the mechanical components of the camera such as the lenses when focusing or zooming. Recording media4K video (and high bit-rate HD) files are big, it could consume nearly 43GB of disk space for 1 hour of footage, Not only are these files sizable, they also require media capable of fast, continuous write speeds. Most manufacturers recommend SDHC/XC cards with a UHS-I U3 rating, U3 cards guarantee a minimum write speed of 30MB/s. Another major advantage of using fast media shows up on the back end. Bringing big files into the computer takes time. If your project has you shooting and backing up on site, read speeds are certainly a factor in choosing new memory cards. Top 4K Cameras Recommended1. Sony Alpha A7S II Lens Mount Sony E-Mount Camera Format Full-Frame Pixels Actual: 12.4 MegapixelEffective: 12.2 Megapixel Max Resolution 4240 x 2832 Aspect Ratio 3:2, 16:9 Memory Card Type SDSDHCSDXCMemory Stick PRO Duo (High Speed) Video Format up to 3840 x 2160p at 23.98, 25, 29.97 fps (100 Mbps XAVC S) Battery 1 x NP-FW50 Rechargeable Lithium-ion Battery Pack, 7.4 VDC, 1020 mAh Dimensions (WxHxD) 4.6 x 2.7 x 1.5” / 116.8 x 68.6 x 38.1 mm Weight 22.12 oz / 627 g with battery and memory card By far, Sony Alpha A7S II is the best 4K video camera in the market. It already received tons of great feedbacks on internet, we highly recommend to choose this camera if you have enough budget, this camera won’t let you disappointed in any ways. The uncompressed 4K video resolution goes all the way up to 3840 x 2160 pixels and you also have some additional XLR audio inputs for external microphones to capture better quality audio. It also has the advantage of using the whole sensor width for recording video, and of being able to record to the memory card while outputting 4:2:2 footage to a HDMI recorder, but proves itself to be capable for stills shooting too. Sony Alpha A7S IICheck Price on Amazon.com Built-in Wi-Fi connectivity enables the a7S II to instantly share imagery to mobile devices for direct sharing online to social networking, via email, and to cloud storage sites. NFC (Near Field Communication) is also supported, which allows for one-touch connection between the camera and compatible mobile devices; no complex set-up is required. Once connected, the linked mobile device can also display a live view image on its screen and remotely control the camera’s shutter. 2. Panasonic Lumix GH4 Lens Mount Micro Four Thirds Camera Format Micro Four Thirds (2x Crop Factor) Pixels Actual: 17.2 MegapixelEffective: 16.05 Megapixel Max Resolution 4608 x 3456 Aspect Ratio 4:3, 16:9 Memory Card Type SDSDHCSDXC Video Format up to 4096 x 2160p at 24 fps (100 Mbps MOV) Battery 1Rechargeable Lithium-ion Battery Pack, 7.2 VDC, 1860 mAh Dimensions (WxHxD) 5.2 x 3.7 x 3.3” / 132.9 x 93.4 x 83.9 mm Weight 19.75 oz / 560 g with SD card and Battery Panasonic Lumix GH4 is a true hybrid camera designed for both professional photo and video use. it delivers video quality surpassing many professional video cameras. Video can be recorded in a variety of formats, from efficient AVCHD and AVCHD Progressive, to 200 Mbps All-Intra and 100 Mbps IPB MOV and MP4 formats. It has a 16 MP sensor, great low light support, and ISO up to 25600. The design isn’t necessarily as compact as others but it is still feasible for most applications that don’t involve running around with their camera. Panasonic Lumix GH4Check Price on Amazon.com GH4 also have 4K photo mode, you can shoot photos in 4K, so if you also wanted a camera that was great for photography, here’s a nice one to grab since it’s pretty cheap when compared to other heavy-hitters in the best 4K video camera category. 3. Nikon D500 Lens Mount Nikon F Camera Format DX / (1.5x Crop Factor) Pixels Actual: 21.51 MegapixelEffective: 20.9 Megapixel Max Resolution 5568 x 3712 Aspect Ratio 3:2 Memory Card Type SDSDHCSDXCXQD Video Format up to 3840 x 2160p at 24, 25, 30 fps (H.264) Battery 1 x EN-EL15 Rechargeable Lithium-ion Battery Pack, 7 VDC, 1900 mAh Dimensions (WxHxD) 5.8 x 4.5 x 3.2” / 147.0 x 115.0 x 81.0 mm Weight 1.89 lb / 860 g with battery and memory card Nikon 2016 flagship model certainly didn’t hold back with the specs, the capable of recording more than just stills, it supports 4K UHD video recording at 30, 25, and 24 fps frame rates and Full HD/HD recording at up to 60 fps, along with the ability to save movie files to the in-camera memory cards or as an uncompressed file to an optional external recorder via HDMI out. Nikon D500Check Price on Amazon.com As with still shooting, the wide range of sensitivities is available for recording in low- and bright-light conditions, ranging from expanded ISO 100-1640000, and sensitivity values are manually adjustable via the dedicated movie-shooting menu. Also, a video-optimized Flat Picture Control mode can be used during recording to flatten the overall contrast curve for more control during post-production and color grading. In addition to straight movie recording, time-lapse recording, for up to 9999 consecutive frames shot over the course of up to one week, is also possible with up to 4K UHD/30p output from the camera. 4. GoPro Hero 5 Black Aspect Ratio 4:3, 16:9 Recording Media MicroSD Video Format up to 3840 x 2160p at 24, 25, 30 fps (MP4) Battery Rechargeable Lithium-Ion Battery Pack Battery, 1220 mAh Dimensions (WxHxD) 8.8 x 5.8 x 2.6” Weight 1.05 lb You must heard of GoPro and their domination in the sports and action video camera market, but did you know their high end models can shoot in 4K video? This new released HERO5 Black can record in UHD 4K resolution up to 30fps or switch to lower resolutions such as 1080p and 720p for access to higher frame rates, more FOV (Field Of View) options, and electronic stabilization. GoPro HERO 5 BlackCheck Price on Amazon.com Audio for video is recorded using three microphones. In normal conditions, the HERO5 Black will process the audio for a stereo signal. If high winds start affecting the audio, the HERO5 Black can intuit which microphone is picking up the best sound and automatically switch to that microphone in real-time and filter out any excess wind noise It also come with a photo mode, In addition to standard JPEG capture, the HERO5 Black can also capture raw images in the .GPR format which can be processed for high quality output.","categories":[{"name":"Reviews","slug":"Reviews","permalink":"https://cheeper.io/blog/categories/Reviews/"}],"tags":[{"name":"Camera","slug":"Camera","permalink":"https://cheeper.io/blog/tags/Camera/"},{"name":"4K","slug":"4K","permalink":"https://cheeper.io/blog/tags/4K/"}]},{"title":"Is There a PlayStation 5 (PS5)? Updates on Specs and Release","slug":"Is-There-a-PlayStation-5-PS5-Updates-on-Specs-and-Release","date":"2017-02-12T05:06:57.000Z","updated":"2017-02-12T08:51:55.344Z","comments":true,"path":"2017/Is-There-a-PlayStation-5-PS5-Updates-on-Specs-and-Release/","link":"","permalink":"https://cheeper.io/blog/blog/2017/Is-There-a-PlayStation-5-PS5-Updates-on-Specs-and-Release/","excerpt":"PS4 Pro just out for couple of months and we are already hearing rumors on Sony next generation console - PlayStation 5. Up to date, there is no official announcement about PS5’s release and specs, but there is one thing we could expect that its power would be formidable compared to other console systems. Who knows, it might surpass Microsoft’s Project Scorpio as well.","text":"PS4 Pro just out for couple of months and we are already hearing rumors on Sony next generation console - PlayStation 5. Up to date, there is no official announcement about PS5’s release and specs, but there is one thing we could expect that its power would be formidable compared to other console systems. Who knows, it might surpass Microsoft’s Project Scorpio as well. Sony PlayStation 4 ProCompare PriceNOW VR compatibility with 4K resolution Sony released PlayStation VR and became the first console manufacturer embracing VR technology, of course, PlayStation VR is competing with the Oculus Rift and the HTC Vive, and it’s cheaper with less resolution and frame rates, but the frame rates would be improved if it running on a PS4 Pro. This proved that Sony has jumped on board of virtual reality. So it’s a good bet that, Sony would like to return to the VR market with a higher-end VR equipment(maybe called PlayStation VR 2?) with PS5, and we have enough reasons to believe PS5 would take VR gaming experience to a next level. We all know VR is the future, but 4k is the present. No matter Xbox One S or PlayStation 4 Pro, both are 4K compatible, and PS5 would support playing games in native 4K. Mark Cerny is the lead architect on the PS4 and the PS4 Pro, in an interview with the Japanese site AV Watch, Cerny was talking about the PS4 Pro and the argument surrounding 4K, he said that the image reaches resolutions are “extremely close to 4K”, this leads us to believe that the new system will most certainly run games at 4K. Mark’s comments also give us a potential window into the PS5, he believes that 4K is only achievable with 8 teraflops of power, then it’s safe to assume he’s going to shoot for this when he’s designing the PS5. Sony PlayStation VRCheck Price onAmazon.com A Cloud-Based Gaming Platform? Recently, Masayasu Ito, Sony executive vice president, shared his thoughts on the PS5 with the online edition of the Japanese publication Nikkei: I think there will be a PS5. However, I don’t know what form it’ll have. It could be a physical console, or it could be in the cloud. But even if the form might change, PS5 Games will be born. This is what we want. This year, Sony has made the first step to cloud gaming services with the release of PlayStation Now and the PlayStation TV console. However, all exsiting services haven’t exactly taken off, Sony likes the idea of a streaming game service, but mostly the gradual introduction of new hardware like PlayStation VR and new services like PlayStation Now gives them the opportunity to test the waters. Once Sony has all the results, they would make a final desicion on PS5’s form. Sony PlayStation TV BundleCheck Price onAmazon.com Dualshock 5 Controller There is another exciting concept - DualShock 5 Controller, people guessing Dualshock 5 will be on the ultimate ergonomic controller experience, the touchpad is switched out for a touchscreen which could able to display everything from radar, to health, to other creative concepts. Also wireless charging would be intergrated with PS5 controller, with wireless charging, gamers can quickly and easily recharge the controller when it gets low. Additional features we can expect would be inspired by Xbox controllers that have a lot of customization options. For example, the sensitivity of the buttons will be adjustable in PS5 apps. Sony DualShock 4 Wireless ControllerCheck Price onAmazon.com Releasing in 2018?In an interview with The Verge, Shawn Layden, head of SIEA and the PlayStation Worldwide Studios Group said: Right now we were concentrating on how do we iterate within this PS4 life cycle. The technology and improvements behind PS4 Plus are our way of articulating where we think the market wants to go. People will want to have greater fidelity of images and graphics. Where we go from there, we’re going to have to wait and see. It’s our first time innovating within the life cycle, so I’m not exactly sure what impact that will have on our plan going forward. But there will be more PlayStations. Meanwhile, Andrew House, the CEO of Sony Interactive Entertainment said in E3 2016: I’m not suggesting we want to bring the games industry to an 18-month-two-year cycle because then you would lose an awful lot of the fixed platform benefits we’ve enjoyed that allow for these really great leaps in game experience. However, we did think there was an opportunity to reflect on the traditional lifecycle, and on 4K technology, and say maybe there’s an opportunity, within the course of a normal lifecycle to offer something else. Something a little bit better, for a segment of the market that feels that this is important. Numerous rumors said PS5 would be announced on 2018, one of the famous prediction came from Damian Thong who accurately predicting the PS4 Pro and Slim released: PS4 Pro? Wait, what about PS5? Macquarie&#39;s Damian Thong who correctly predicted PS4 slim and Pro says PS5 may arrive in 2nd half of 2018.&mdash; Takashi Mochizuki (@mochi_wsj) September 8, 2016 PS4 Pro released in 2016, and based on above comments, it’s fair to say we won’t see the PS5 in 2017, but we can expect PS5 will be the generational leap console we’re looking for","categories":[{"name":"Previews","slug":"Previews","permalink":"https://cheeper.io/blog/categories/Previews/"}],"tags":[{"name":"Game","slug":"Game","permalink":"https://cheeper.io/blog/tags/Game/"},{"name":"Sony","slug":"Sony","permalink":"https://cheeper.io/blog/tags/Sony/"},{"name":"PlayStation","slug":"PlayStation","permalink":"https://cheeper.io/blog/tags/PlayStation/"}]},{"title":"Top 5 Cheap Phones You Should Consider in 2017","slug":"Top-5-Cheap-Phones-You-Should-Consider-in-2017","date":"2017-02-10T06:16:31.000Z","updated":"2017-02-11T14:03:30.765Z","comments":true,"path":"2017/Top-5-Cheap-Phones-You-Should-Consider-in-2017/","link":"","permalink":"https://cheeper.io/blog/blog/2017/Top-5-Cheap-Phones-You-Should-Consider-in-2017/","excerpt":"People always like to talk about iPhone 7, Galaxy S7 Edge and Google Pixel, those big names steal headlines around the world and empty your pocket, but you know what? In 2017, you don’t have to spend too much to get a great quality phone with decent specs and features. Some of 2017’s budget smartphone offerings even put those fancy flagships to shame. Here we offer top 5 cost-effective smartphones you could buy in 2017.","text":"People always like to talk about iPhone 7, Galaxy S7 Edge and Google Pixel, those big names steal headlines around the world and empty your pocket, but you know what? In 2017, you don’t have to spend too much to get a great quality phone with decent specs and features. Some of 2017’s budget smartphone offerings even put those fancy flagships to shame. Here we offer top 5 cost-effective smartphones you could buy in 2017. 1. Moto G4 Plus (Down to $250) Moto G4 Plus (4th Gen) 5.5 Inch full HDCompare PriceNOW CPU up to 1.5 GHz Qualcomm Snapdragon 617 OS Android 6.0.1, Marshmallow Memory 2 GB / 4 GB Storage 16 GB / 64 GB internal, up to 128 GB microSD Card support Battery 3000 mAh TurboPower fast charging battery Display 5.5” 1080p Full HD Cameras 16 MP Rear Camera/5 MP Front Camera Dimensions 153 mm x 76.6 mm x 7.9 mm Weight 155g Special Features Water ProtectionCustomized MaterialsTwo years of Google Photos storage The Moto G4 Plus is the highest spec budget phone from the company in 2016 and features some of the best features we’ve seen on a phone at this price point, With Snapdragon 617 processor, its speed is much faster than every other budget phone you can buy today, giving it as much processing power as phones that are twice the price. In 2017, the market price of G4 Plus is around $250. 2. Le S3 (Down to $199) Le S3 EcoPhone / 5.5” Full HD / 3GB RAM / 32GB StorageCheck Price onAmazon.com CPU Snapdragon 652, 64-bit Octal-Core 1.8GHz OS Android 6.0, Marshmallow Memory 3GB RAM Storage 32GB Storage Battery 3000mAh Battery Display 5.5” 1080p Full HD Cameras 16 MP Rear Camera/8 MP Front Camera Dimensions 151 mm x 74 mm x 7.5 mm Weight 153g Special Features LeEco’s Ecosystem User Interface (eui)Fingerprint Recognition LeEco started to enter U.S market since 2016, and their well-received flagship phone is called LeEco Pro 3. LeEco doesn’t rely solely on flagship phones, the company also bringing a mid-end phone called Le S3, and S3 has an exact same look as Pro3. 3. Xiaomi Redmi Note 3 (Down to $150) Xiaomi Redmi Note 3 5.5 Inch FHDCheck Price onAmazon.com CPU Snapdragon 650, 64-bit hexa-core 1.8GHz Graphic Card Adreno 510 OS Android 6.0.1, Marshmallow Memory 3GB dual-channel LPDDR3 RAM Storage 16 GB / 64 GB internal, up to 128 GB microSD Card support Battery 4000mAh high density battery Display 5.5” 1080p Full HD Cameras 16 MP Rear Camera/5 MP Front Camera Dimensions 150 mm x 76 mm x 8.6 mm Weight 164g Special Features Fingerprint TouchHigh-fidelity HD SoundMi Remote Control System There’s no way to miss the king of the mid-end. Redmi Note 3 featuring some very enticing specs at a price that is unbelievable. Redmi Note 3 is one of the best built phones you would ever owned. Holding the phone, you certainly do not feel as if this is a $150 phone. 4. Sony Xperia E5 (Down to $165) Sony Xperia E5 5.0” / 16GB-1.5GB RAM / 13MPCheck Price onAmazon.com CPU Quad-core 1.3 GHz Cortex-A53 Graphic Card Mali-T720MP2 OS Android 6.0.1, Marshmallow Memory 1.5 GB RAM Storage 16 GB, up to 256 GB microSD(dedicated slot) Battery Non-removable Li-Po 2300 mAh battery Display 5.0” IPS LCD capacitive touchscreen Cameras 16 MP Rear Camera/5 MP Front Camera Dimensions 144 mm x 69 mm x 8.2 mm Weight 147g Sony’s 2016 latest budget phone, and the price would going down further in 2017. Xperia E5 has a great display resolution so you can watch video on your phone without getting frustrated. 5. Galaxy J7 2016 Edition (Down to $220) Samsung Galaxy J7 5.5” HD / 1.5GB RAM / 16GB StorageCompare PriceNOW CPU Snapdragon 617, 64-bit Octal-Core 1.6GHz OS Android 6.0, Marshmallow Memory 2GB RAM Storage 16 GB, up to 256GB microSD Battery Removable Li-Ion 3300 mAh battery Display 5.5” Super AMOLED capacitive touchscreen Cameras 13 MP Rear Camera Dimensions 152 mm x 78 mm x 7.5 mm Weight 171g This 2016 affordable Samsung phone comes with a modern look, metal frame, and a few premium features like the Quick Launch camera shortcut. This is a nice mid-end phone. Very reliable with its great battery life","categories":[{"name":"Top 5s","slug":"Top-5s","permalink":"https://cheeper.io/blog/categories/Top-5s/"}],"tags":[{"name":"Sony","slug":"Sony","permalink":"https://cheeper.io/blog/tags/Sony/"},{"name":"Phone","slug":"Phone","permalink":"https://cheeper.io/blog/tags/Phone/"},{"name":"Moto","slug":"Moto","permalink":"https://cheeper.io/blog/tags/Moto/"},{"name":"LeEco","slug":"LeEco","permalink":"https://cheeper.io/blog/tags/LeEco/"},{"name":"Samsung","slug":"Samsung","permalink":"https://cheeper.io/blog/tags/Samsung/"},{"name":"Xiaomi","slug":"Xiaomi","permalink":"https://cheeper.io/blog/tags/Xiaomi/"}]},{"title":"Xbox Scorpio - The Next Generation Game Console","slug":"Xbox-Scorpio-The-Next-Generation-Game-Console","date":"2017-02-05T09:03:15.000Z","updated":"2017-02-22T14:15:46.000Z","comments":true,"path":"2017/Xbox-Scorpio-The-Next-Generation-Game-Console/","link":"","permalink":"https://cheeper.io/blog/blog/2017/Xbox-Scorpio-The-Next-Generation-Game-Console/","excerpt":"Microsoft plans to release their next generation game console - Xbox Scorpio (people call it Xbox S) on holiday season of 2017, let’s see how this console would blow your mind… Xbox One SCompare PriceNOW","text":"Microsoft plans to release their next generation game console - Xbox Scorpio (people call it Xbox S) on holiday season of 2017, let’s see how this console would blow your mind… Xbox One SCompare PriceNOW Official Preview of Xbox Scorpio Xbox Scorpio is built for VR Microsoft HoloLens Game: Fragments Xbox Scorpio won’t just be a machine capable of playing games in VR, it’ll be built for VR, Xbox team taking VR integration very seriously, they are working closely with Oculus from the early days of Xbox Scorpio, and of course, Microsoft HoloLens would be also integrated with Scorpio. And in the announcement of Scorpio, Fallout 4 VR was clearly mentioned that would be released on Scorpio platform. Scorpio’s Performance Would be InsaneXbox Scorpio will have an 8-core CPU and a graphics card with 6TFLOPs (trillion floating point operations per second) of power which almost same as today’s top-end graphic card Nvidia GeForce GTX 1070. It will also have 320GB/sec of memory bandwidth Scorpio is 4K-ready As we know Xbox One S supports a lite version of 4K gaming. Scorpio would be very first game console that fully support 4K gaming which means it could easily run 4K games at 60Hz.","categories":[{"name":"Previews","slug":"Previews","permalink":"https://cheeper.io/blog/categories/Previews/"}],"tags":[{"name":"Game","slug":"Game","permalink":"https://cheeper.io/blog/tags/Game/"},{"name":"Xbox","slug":"Xbox","permalink":"https://cheeper.io/blog/tags/Xbox/"},{"name":"Scorpio","slug":"Scorpio","permalink":"https://cheeper.io/blog/tags/Scorpio/"}]},{"title":"Best Ultrabook? Lenovo Yoga 910 Reviews","slug":"Best-Ultrabook-Lenovo-Yoga-910-Reviews","date":"2017-02-03T04:37:04.000Z","updated":"2017-02-11T02:36:28.578Z","comments":true,"path":"2017/Best-Ultrabook-Lenovo-Yoga-910-Reviews/","link":"","permalink":"https://cheeper.io/blog/blog/2017/Best-Ultrabook-Lenovo-Yoga-910-Reviews/","excerpt":"Lenovo released their latest 2-in-1 ultrabook Yoga 910 with big wow features like watchband hinge and fingerprint security, Yoga 910 also offer a nearly-bezel-free 13.9-inch display that gives you more to look at without taking up extra space. Its battery life also has seen a pretty big increase and will now last 10.5 hours on a charge. Now the price has down to $1049 compare to the original price at $1329 Lenovo Yoga 910Compare PriceNOW","text":"Lenovo released their latest 2-in-1 ultrabook Yoga 910 with big wow features like watchband hinge and fingerprint security, Yoga 910 also offer a nearly-bezel-free 13.9-inch display that gives you more to look at without taking up extra space. Its battery life also has seen a pretty big increase and will now last 10.5 hours on a charge. Now the price has down to $1049 compare to the original price at $1329 Lenovo Yoga 910Compare PriceNOW Overview Lenovo Yoga 910 - 13.9” FHD Touch - 7th Gen i7-7500U - 8GB - 256GB SSDCheck Price on Amazon.com Specs CPU 2.7-GHz Intel Core i7-7500U Operating System Up to Windows 10 Home Graphics Intel HD graphics 620 Memory Up to 16 GB DDR4 2133 MHz Storage Up to 1 TB PCIe SSD Webcam / Microphone 720p with dual array microphone Audio 2 x JBL stereo speakers with Dolby Audio™ Premium Battery Up to 9 hours with local video playback Display 13.9” FHD IPS Multi-touch (1920x1080) with integrated camera13.9” UHD IPS Multi-touch (3840x2160) with integrated camera Material Aluminum Dimensions (W x D x H) (inches) : 12.72 x 8.84 x 0.56(mm) : 323 x 224.5 x 14.3 Weight Starting at 3.04 lb (1.38 kg) Special Features Yoga watchband hingeUnibody metal design3-sided narrow display bezelFingerprint securityBacklight keyboard Ports USB 3.0 Type-C with video-outUSB 2.0 Type-C with chargingUSB 3.0 with always-on chargingAudio combo jack New Designed Signature Watchband HingeSince Yoga 900 seriers, Lenovo re-designed their signature watchband hinge, as Kevin Beck said on Lenovo’s Blog: There is an incredible amount of design and engineering that went into inventing this attractive little feature. While its design may look simple, the engineering behind it definitely is not. In fact, it took years to innovate and continually refine the YOGA 900S hinge to what it is today. This new classy, sophisticated hinge that puts the Yoga 910 on the short list of the best-looking laptops on the market Lenovo Yoga 910 - 13.9” FHD Touch - 7th Gen i7-7500U - 8GB - 256GB SSDCheck Price on Amazon.com 13.9-Inch 4K ScreenThanks to Yoga 910’s smaller-bezel design, the screen size increased almost 10 percent than those on 13.3-Inch systems, with this large beautiful 4K screen, Yoga 910 would be the first choice of your entertainment laptop in 2017. High Performance for Gaming &amp; WorkingWith 2.7-GHz Intel Core i7 7500U CPU, 8GB RAM and a 256GB SSD, Yoga 910 makes it much faster and more power efficient. It beat the Yoga 900 on the 3DMark Cloud Gate (6,815) and Fire Strike Extreme (425) tests, while both scores can be considered playing major 3D games smoothly.","categories":[{"name":"Reviews","slug":"Reviews","permalink":"https://cheeper.io/blog/categories/Reviews/"}],"tags":[{"name":"Lenovo","slug":"Lenovo","permalink":"https://cheeper.io/blog/tags/Lenovo/"},{"name":"Laptop","slug":"Laptop","permalink":"https://cheeper.io/blog/tags/Laptop/"},{"name":"Yoga","slug":"Yoga","permalink":"https://cheeper.io/blog/tags/Yoga/"}]},{"title":"Most Anticipated Phones of 2017","slug":"most-anticipated-phones-of-2017","date":"2017-01-26T02:40:19.000Z","updated":"2017-02-10T14:44:50.333Z","comments":true,"path":"2017/most-anticipated-phones-of-2017/","link":"","permalink":"https://cheeper.io/blog/blog/2017/most-anticipated-phones-of-2017/","excerpt":"Now we are officially entered in 2017, The speed of mobile phone replacement become faster and faster, what phones we could expect in 2017? Let’s see the five most anticipated phones in 2017, which one is better, which one is more suitable for you? Hope this article could help you to make a decision.","text":"Now we are officially entered in 2017, The speed of mobile phone replacement become faster and faster, what phones we could expect in 2017? Let’s see the five most anticipated phones in 2017, which one is better, which one is more suitable for you? Hope this article could help you to make a decision. Apple iPhone 8/8S The year of 2017 is the ten anniversary of Apple’s iPhone, the outside world agreed that Apple will make the largest upgrading for iPhone in its history. The next version of iPhone may be called iPhone 8/8s, but it is also possible to use a new version name. the upgrade may include the use of new glass shell appearance, AMOLED hyperboloid screen, wireless charging, super dual camera and so on. There is a little chance that Apple may also release iPhone 7S in 2017, but based on past experiences, Apple won’t release two flagship phones at same year. Samsung Galaxy S8/S8 Edge/Note 8 The era of smartphone technology creators have long been more than just Apple, Samsung’s hyperbolic screen is the most successful invention in 2016, at the same time, Samsung is also taking the lead of camera technology in the entire smartphone industry. Due to the current Samsung phones still not use dual camera, and the industry which either Apple or various international and domestic manufacturers have taken the dual camera, so it is worth to look forward the new Galaxy phones integrate dual camera, in addition, because of the obvious problems of Note 7, the S Pen and iris recognition features has also been delayed, and those features may add into the new Note 8. Huawei P10/Mate 10 2016 is a successful year for Huawei P9 and Mate 9, the best selling point is Leica’s dual camera. In 2017, beside dual camera, Huawei P10/Mate 10 would also integrate hyperbolic screen and ultrasonic fingerprint identification technology, and P10/Mate 10 would use most recent release Kirin 970 CPU. Last year, Mate 9 also launched a special version of cooperation with Porsche, Mate 10 is expected to continue this strategy. ASUS ZenFone AR The quality of ASUS ZenFone seriers has been well recognized, every year ASUS will also launch new models with numerous new characteristics, last year, ASUS has a very good cooperation relationship with Qualcomm, this year ZenFone AR would also be built with SnapDragon 835 CPU. On this year’s CES, ASUS first introduced ZenFone AR, from their poster, ZenFone AR would support dual camera and AR (the second phone in the world to support Google Tango). OnePlus 4 OnePlus phones has been well-known by the high performance and low-cost, the 2017 flagship OnePlus 4 may be equipped with the latest Qualcomm SnapDragon 835 CPU and 8G memory, and the price may lower than $500.","categories":[{"name":"Previews","slug":"Previews","permalink":"https://cheeper.io/blog/categories/Previews/"}],"tags":[{"name":"Apple","slug":"Apple","permalink":"https://cheeper.io/blog/tags/Apple/"},{"name":"Phone","slug":"Phone","permalink":"https://cheeper.io/blog/tags/Phone/"},{"name":"Samsung","slug":"Samsung","permalink":"https://cheeper.io/blog/tags/Samsung/"},{"name":"Huawei","slug":"Huawei","permalink":"https://cheeper.io/blog/tags/Huawei/"},{"name":"ASUS","slug":"ASUS","permalink":"https://cheeper.io/blog/tags/ASUS/"},{"name":"OnePlus","slug":"OnePlus","permalink":"https://cheeper.io/blog/tags/OnePlus/"}]},{"title":"New MacBook Pro vs Dell XPS 15","slug":"New-MacBook-Pro-vs-Dell-XPS-15","date":"2017-01-25T07:49:11.000Z","updated":"2017-01-26T02:13:54.576Z","comments":true,"path":"2017/New-MacBook-Pro-vs-Dell-XPS-15/","link":"","permalink":"https://cheeper.io/blog/blog/2017/New-MacBook-Pro-vs-Dell-XPS-15/","excerpt":"The Dell XPS 15 and the MacBook Pro are both excellent computers. It often is said that the two are so close in terms of quality that it’s difficult to say which is better. However, they each have their own benefits and drawbacks.","text":"The Dell XPS 15 and the MacBook Pro are both excellent computers. It often is said that the two are so close in terms of quality that it’s difficult to say which is better. However, they each have their own benefits and drawbacks. Pros Of The MacBook Pro MacBook Pro Security: The MacBook Pro uses a Mac Sierra operating system, which tends to be more secure than the Windows 10 used by the Dell XPS15. While macintosh operating systems are not completely immune to malware, they are far more malware resistant than Windows. The MacBook Pro’s Built In Voice Assistant: The MacBook Pro comes with Siri. While the Dell XPS15 offers Cortana, Siri is much more reliable. Additionally, Siri does not track your voice search history like Cortana. Your voice searches with Siri aren’t saved with your IP address, name, or any personally identifying information. The Touch Screen: The MacBook Pro touch screen is one of the best on the market. Many have said that the experience of using the MacBook Pro is like combining an iPhone with a laptop. Despite there being a touchscreen, there also is a quality keyboard to use. While it’s possible to get a touchscreen on a Dell XPS 15, the MacBook Pro is of better quality. Cons Of The MacBook Pro Less Ports: The MacBook Pro doesn’t have anywhere near the number of ports as the Dell XPS 15. This means that it’s not as easy to connect other devices to it. Price: The MacBook Pro will cost you at least $1499 from Apple. If you get the touchscreen, the price rises to $1999. You could check &amp; compare Macbook Pro prices here. A Small Number Of Games Available: There are relatively few games run on a Mac Sierra operating system. While there are some, you’re likely to have a much harder time finding a game that you like. Pros Of Dell XPS 15 Quality Gaming Experience: If you’re a fan of PC games, you’ll definitely want a Windows operating system. The Dell XPS 15 comes with Windows 10. This operating system will allow you to play an exceptionally wide range of games, and you’ll be able to stream games from your Xbox One or PlayStation 4 to your laptop! There are even some Windows 10 games available for free. It’s Environmentally Friendly: The Dell XPS 15 is particularly environmentally friendly. Many computers have toxic metals inside them, but the Dell XPS 15 is designed without mercury and other toxic metals. Battery Life: The Dell XPS 15 potentially can have a somewhat longer battery life than the MacBook Pro. The MacBook Pro has a battery that holds 49.2 watt hours, but the Dell XPS 15 has a battery that holds 60 watt hours. The difference is not that large, but it can make a difference. However, this advantage is eliminated if you get the Dell XPS 15 with a touchscreen. If you get a touchscreen, the battery tends not to last as long as the MacBook Pro. Higher Resolution: The Dell XPS 15 features excellent graphics. In fact, the resolution on the Dell XPS 15 is 3200 x 1800 pixels as opposed to the MacBook Pro’s 2,560 x 1,600 pixels. It even is possible to pay extra to get the Dell XPS 15 with QHD+. This will result in even better graphics More Advanced Processor: The processor on the Dell XPS 15 uses a 7th Generation Intel Core processor. However, the MacBook Pro runs on a 6th Generation Intel Core Processor. High Resolution Webcam: The Dell XPS 15 has a higher resolution webcam than the MacBook Pro. The webcam on the Dell XPS 15 has a resolution of 720p. This is far more than the MacBook Pro’s webcam resolution of 480p. Cons Of The Dell XPS 15 Inaccurate Colors On The Webcam: The Dell XPS 15 webcam doesn’t show colors as they are. Instead, the colors tend to be a bit over-saturated. Lower Quality Audio: While the graphics on the Dell XPS 15 are excellent, the audio isn’t anywhere near this level of quality. However, the MacBook Pro offers higher quality audio. If you listen to music a lot, this can be a reason to choose the MacBook Pro over the Dell XPS 15. Lower Hard Drive Speed: Copying and moving files can take longer with the Dell XPS 15 than the MacBook Pro. The hard drive tends to run substantially slower. On the MacBook Pro, the hard drive speed averages 355.9 mb/s. However, the hard drive on the Dell XPS 15 averages at just 231.33 mb/s. This figure is even slower if you use a Dell XPS 15 with a touchscreen.","categories":[{"name":"Reviews","slug":"Reviews","permalink":"https://cheeper.io/blog/categories/Reviews/"}],"tags":[{"name":"Laptop","slug":"Laptop","permalink":"https://cheeper.io/blog/tags/Laptop/"},{"name":"MacBook","slug":"MacBook","permalink":"https://cheeper.io/blog/tags/MacBook/"},{"name":"XPS15","slug":"XPS15","permalink":"https://cheeper.io/blog/tags/XPS15/"},{"name":"Dell","slug":"Dell","permalink":"https://cheeper.io/blog/tags/Dell/"},{"name":"Apple","slug":"Apple","permalink":"https://cheeper.io/blog/tags/Apple/"}]},{"title":"The Five Cameras Worth to Have","slug":"The-five-cameras-worth-to-have","date":"2017-01-24T09:54:16.000Z","updated":"2017-01-26T02:14:34.953Z","comments":true,"path":"2017/The-five-cameras-worth-to-have/","link":"","permalink":"https://cheeper.io/blog/blog/2017/The-five-cameras-worth-to-have/","excerpt":"Although manufactures release new cameras every year, but most of the latest features are nothing more than a gimmick, how many times the new feature you used after bought a new camera? Maybe once?Many photographers still taking pictures with a camera purchased many years ago.Equipment is not the whole story of photographing, A right camera is much important than a feature-riched camera. In this post, we introducing five cameras deserved to buy, some of them may not have latest hi-tech features, but each one of them is beautifully finished off, and could be used in a long life cycle.","text":"Although manufactures release new cameras every year, but most of the latest features are nothing more than a gimmick, how many times the new feature you used after bought a new camera? Maybe once?Many photographers still taking pictures with a camera purchased many years ago.Equipment is not the whole story of photographing, A right camera is much important than a feature-riched camera. In this post, we introducing five cameras deserved to buy, some of them may not have latest hi-tech features, but each one of them is beautifully finished off, and could be used in a long life cycle. Canon EOS 5D Mark IV Shutterbugs won’t feel strange about 5D seriers, as Canon’s high-end camera model, it’s fourth edition (Mark IV) released in the middle of 2016, and it has been four years and a half since Mark III released, in fact, even if the Mark IV came out, Mark III and Mark II are still thehis hot well cameras in market, and Mark IV will not be out of date for a long time since there is no clue when Mark V would be released. 5D Mark IV exceeded 30 million pixels, also joined with 4K video recording, GPS, Wi-Fi, Dual Pixel and other functions, many people even use this camera to make a movie. Pentax K-1 You may not very familiar with this brand, but never underestimate this camera. K-1 has won the most favorite camera in a Japanese photographers’ survey, Pentax was a big name in traditional film era, their film camera can be said to be a classic memory of the times. As early as in 2000, Pentax has announced the development of a full frame SLR, and after 16 years, Pentax finally released their very first SLR camera K-1. Sony A7R Mark II The A7 seriers has been a legend since the date of it released, A7 camera has a lot of hardcore fans, but also got lots of people who hate it. A7R Mark II pushed the A7 seriers to the peak, and has been widely acclaimed high scores in various camera websites and forums. Nikon D500 If you have a limited budget, you may not need a full frame camera, there are plenty of great residual amplitude cameras could be considerred, such Nikon D500. A lot of configurations and specifications of D500 are very similar to Nikon’s high-end camera D5, but the price is much lower than D5. Ricoh GR GR APS-C format digital camera just launched two generations, but this model has a history of more than 20 years, and the first generation of Ricoh GR released on 1996. Ricoh GR has a great reputation in professional photographers, for example, Japanese famous photographer Daido Moriyama use GR21 as his daily camera. Compared to GR1, GR2 has no substantial upgrades, just add Wi-Fi and NFC, and slightly increased the battery volumn. Thanks to the well design, GR camera became a very handy camera, it could be put in pocket and fully operated by single hand, if you’re a street photographer, this camera must be a good choice.","categories":[{"name":"Top 5s","slug":"Top-5s","permalink":"https://cheeper.io/blog/categories/Top-5s/"}],"tags":[{"name":"Camera","slug":"Camera","permalink":"https://cheeper.io/blog/tags/Camera/"},{"name":"Sony","slug":"Sony","permalink":"https://cheeper.io/blog/tags/Sony/"},{"name":"Canon","slug":"Canon","permalink":"https://cheeper.io/blog/tags/Canon/"},{"name":"Pentax","slug":"Pentax","permalink":"https://cheeper.io/blog/tags/Pentax/"},{"name":"Nikon","slug":"Nikon","permalink":"https://cheeper.io/blog/tags/Nikon/"},{"name":"Ricoh","slug":"Ricoh","permalink":"https://cheeper.io/blog/tags/Ricoh/"}]},{"title":"The 5 Best Gaming Desktops under $500 in 2016","slug":"The-5-Best-Gaming-Desktops-under-500-in-2016","date":"2017-01-23T12:04:03.000Z","updated":"2017-01-26T02:14:18.524Z","comments":true,"path":"2017/The-5-Best-Gaming-Desktops-under-500-in-2016/","link":"","permalink":"https://cheeper.io/blog/blog/2017/The-5-Best-Gaming-Desktops-under-500-in-2016/","excerpt":"1.CybertronPC Borg-Q Gaming Desktop Price: $499 CPU: 3.8 GHz AMD FX Graphics: NVIDIA GeForce GT610 1GB Hard Drive: 1000 GB SATA II Memory: 8 GB DDR3 Free Lifetime Technical Support CybertronPC Borg-Q could be the most popular gaming desktop under $500 in 2016. The price was so wonderful for its ability as a ready-to-go desktop. Thanks to NVIDIA GeForce GT610 and 8GB memory, it would run most of recent released games with clear, vibrant graphics.","text":"1.CybertronPC Borg-Q Gaming Desktop Price: $499 CPU: 3.8 GHz AMD FX Graphics: NVIDIA GeForce GT610 1GB Hard Drive: 1000 GB SATA II Memory: 8 GB DDR3 Free Lifetime Technical Support CybertronPC Borg-Q could be the most popular gaming desktop under $500 in 2016. The price was so wonderful for its ability as a ready-to-go desktop. Thanks to NVIDIA GeForce GT610 and 8GB memory, it would run most of recent released games with clear, vibrant graphics. 2.CybertronPC Electrum QS-A6 Price: $439 CPU: AMD A6-7400K 3.50GHz Dual-Core Graphics: AMD Radeon R5 GPU Hard Drive: 1000 GB SATA II Memory: 16 GB DDR3 Free Lifetime Technical Support Another Cybertron PC with great performance and low cost. 16GB memory and AMD Radeon R5 are the biggest selling points. This computer is definitely starting point to PC gaming. 3.Alienware Steam Machine ASM100-6980BLK Price: $462 CPU: 2.2 GHz Intel Core i7 Graphics: Nvidia GeForce GTX GPU Hard Drive: 1GB SATA Memory: 8 GB DDR3L SDRAM This is not a general purpose PC, it is designed for huge gamers powered by Steam, and every Alienware Steam Machine includes free games as well as exclusive downloadable content for Alienware customers. 4.Lenovo Ideacentre Price: $499 CPU: Intel Quad-Core i5-4460s Graphics: Intel HD graphics 4600 Hard Drive: 2-in-1 hybrid hard drive 2TB 7200 rpm SATA Hard Drive + 8GB Solid State Drive Memory: 16GB DDR3L 1600MHz SDRAM Although Lenovo Ideacentre comes with a less performance graphics card which compared to previous PCs, the 8GB SSD and Quad-Core CPU would handle most of games without a blink. 5.CybertronPC Electrum QS-GT7 Price: $479 CPU: AMD FX-4300 3.80GHz Quad-Core Graphics: Nvidia GeForce GT 730 Hard Drive: 1000 GB SATA II Memory: 8 GB DDR3 Lifetime Technical Support If you are a gamer but not always play most recent games, this computer would exceed your expectations. It could run most of popular online games (WoW, StarCraft, Overwatch etc) in full graphic settings smoothly.","categories":[{"name":"Top 5s","slug":"Top-5s","permalink":"https://cheeper.io/blog/categories/Top-5s/"}],"tags":[{"name":"Desktop","slug":"Desktop","permalink":"https://cheeper.io/blog/tags/Desktop/"},{"name":"Gaming","slug":"Gaming","permalink":"https://cheeper.io/blog/tags/Gaming/"},{"name":"Alienware","slug":"Alienware","permalink":"https://cheeper.io/blog/tags/Alienware/"},{"name":"Lenovo","slug":"Lenovo","permalink":"https://cheeper.io/blog/tags/Lenovo/"},{"name":"CybertronPC","slug":"CybertronPC","permalink":"https://cheeper.io/blog/tags/CybertronPC/"}]},{"title":"Google Pixel Reviews","slug":"google-pixel-reviews","date":"2017-01-20T00:32:32.000Z","updated":"2017-01-26T02:13:33.378Z","comments":true,"path":"2017/google-pixel-reviews/","link":"","permalink":"https://cheeper.io/blog/blog/2017/google-pixel-reviews/","excerpt":"For many cell phone enthusiasts, Nexus phone has been a belief-like existence: high perfomance with low-cost, authentic Android experience, all of these make Nexus a must-have phone in Android’s world.","text":"For many cell phone enthusiasts, Nexus phone has been a belief-like existence: high perfomance with low-cost, authentic Android experience, all of these make Nexus a must-have phone in Android’s world. However, all this eventually become memories - Google decided end the Nexus series on 2016, and created new signature series and named it Pixel. Prior to the Nexus phone has been the foundry to provide design solutions, Google is responsible for changes and additions, so we can find the Nexus phone on behalf of the various foundries.This year’s Pixel mobile phone designed entirely by Google itself, on behalf of the industry is only responsible for the production and assembly of HTC, which is very similar to the relationship between Apple and Foxconn. This time you can only find one capital “G” on the back of pixel phone, and no traces of the foundry, which also marks Google officially enter cellphone hardware industry. Pixel / Pixel XL are equipped with: Snapdragon 821 CPU 4GB memory 12.3 million pixel camera 32GB/128GB storage And Google Pixel has 5-inch 1080P screen and 2770mAh battery; On the other hand Pixel XL has 5.5-inch 2K screen and 3450mAh battery. Both support fast charge, and Google marketing them for 15 minutes charging can use 7 hours. On Google Store, the official price of Pixel was from $649 with free shipping. On Amazon, the price was from $550, and you could check a full price comparison list on our website","categories":[{"name":"Reviews","slug":"Reviews","permalink":"https://cheeper.io/blog/categories/Reviews/"}],"tags":[{"name":"Phone","slug":"Phone","permalink":"https://cheeper.io/blog/tags/Phone/"},{"name":"Google","slug":"Google","permalink":"https://cheeper.io/blog/tags/Google/"},{"name":"Pixel","slug":"Pixel","permalink":"https://cheeper.io/blog/tags/Pixel/"},{"name":"Android","slug":"Android","permalink":"https://cheeper.io/blog/tags/Android/"}]}]}