{"meta":{"title":"Cheeper Blog","subtitle":null,"description":null,"author":"Cheeper.io","url":"https://cheeper.io/blog"},"pages":[],"posts":[{"title":"The Five Cameras Worth to Have","slug":"The-five-cameras-worth-to-have","date":"2017-01-24T09:54:16.000Z","updated":"2017-01-24T13:29:50.068Z","comments":true,"path":"2017/The-five-cameras-worth-to-have/","link":"","permalink":"https://cheeper.io/blog/blog/2017/The-five-cameras-worth-to-have/","excerpt":"Although manufactures release new cameras every year, but most of the latest features are nothing more than a gimmick, how many times the new feature you used after bought a new camera? Maybe once?Many photographers still taking pictures with a camera purchased many years ago.Equipment is not the whole story of photographing, A right camera is much important than a feature-riched camera. In this post, we introducing five cameras deserved to buy, some of them may not have latest hi-tech features, but each one of them is beautifully finished off, and could be used in a long life cycle.","text":"Although manufactures release new cameras every year, but most of the latest features are nothing more than a gimmick, how many times the new feature you used after bought a new camera? Maybe once?Many photographers still taking pictures with a camera purchased many years ago.Equipment is not the whole story of photographing, A right camera is much important than a feature-riched camera. In this post, we introducing five cameras deserved to buy, some of them may not have latest hi-tech features, but each one of them is beautifully finished off, and could be used in a long life cycle. Canon EOS 5D Mark IV Shutterbugs won’t feel strange about 5D seriers, as Canon’s high-end camera model, it’s fourth edition (Mark IV) released in the middle of 2016, and it has been four years and a half since Mark III released, in fact, even if the Mark IV came out, Mark III and Mark II are still thehis hot well cameras in market, and Mark IV will not be out of date for a long time since there is no clue when Mark V would be released. 5D Mark IV exceeded 30 million pixels, also joined with 4K video recording, GPS, Wi-Fi, Dual Pixel and other functions, many people even use this camera to make a movie. Pentax K-1 You may not very familiar with this brand, but never underestimate this camera. K-1 has won the most favorite camera in a Japanese photographers’ survey, Pentax was a big name in traditional film era, their film camera can be said to be a classic memory of the times. As early as in 2000, Pentax has announced the development of a full frame SLR, and after 16 years, Pentax finally released their very first SLR camera K-1. Sony A7R Mark II The A7 seriers has been a legend since the date of it released, A7 camera has a lot of hardcore fans, but also got lots of people who hate it. A7R Mark II pushed the A7 seriers to the peak, and has been widely acclaimed high scores in various camera websites and forums. Nikon D500 If you have a limited budget, you may not need a full frame camera, there are plenty of great residual amplitude cameras could be considerred, such Nikon D500. A lot of configurations and specifications of D500 are very similar to Nikon’s high-end camera D5, but the price is much lower than D5. Ricoh GR GR APS-C format digital camera just launched two generations, but this model has a history of more than 20 years, and the first generation of Ricoh GR released on 1996. Ricoh GR has a great reputation in professional photographers, for example, Japanese famous photographer Daido Moriyama use GR21 as his daily camera. Compared to GR1, GR2 has no substantial upgrades, just add Wi-Fi and NFC, and slightly increased the battery volumn. Thanks to the well design, GR camera became a very handy camera, it could be put in pocket and fully operated by single hand, if you’re a street photographer, this camera must be a good choice.","categories":[],"tags":[{"name":"camera","slug":"camera","permalink":"https://cheeper.io/blog/tags/camera/"},{"name":"Canon","slug":"Canon","permalink":"https://cheeper.io/blog/tags/Canon/"},{"name":"Pentax","slug":"Pentax","permalink":"https://cheeper.io/blog/tags/Pentax/"},{"name":"Sony","slug":"Sony","permalink":"https://cheeper.io/blog/tags/Sony/"},{"name":"Nikon","slug":"Nikon","permalink":"https://cheeper.io/blog/tags/Nikon/"},{"name":"Ricoh","slug":"Ricoh","permalink":"https://cheeper.io/blog/tags/Ricoh/"}]},{"title":"The 5 Best Gaming Desktops under $500 in 2016","slug":"The-5-Best-Gaming-Desktops-under-500-in-2016","date":"2017-01-23T12:04:03.000Z","updated":"2017-01-24T13:32:18.268Z","comments":true,"path":"2017/The-5-Best-Gaming-Desktops-under-500-in-2016/","link":"","permalink":"https://cheeper.io/blog/blog/2017/The-5-Best-Gaming-Desktops-under-500-in-2016/","excerpt":"1.CybertronPC Borg-Q Gaming Desktop Price: $499 CPU: 3.8 GHz AMD FX Graphics: NVIDIA GeForce GT610 1GB Hard Drive: 1000 GB SATA II Memory: 8 GB DDR3 Free Lifetime Technical Support CybertronPC Borg-Q could be the most popular gaming desktop under $500 in 2016. The price was so wonderful for its ability as a ready-to-go desktop. Thanks to NVIDIA GeForce GT610 and 8GB memory, it would run most of recent released games with clear, vibrant graphics.","text":"1.CybertronPC Borg-Q Gaming Desktop Price: $499 CPU: 3.8 GHz AMD FX Graphics: NVIDIA GeForce GT610 1GB Hard Drive: 1000 GB SATA II Memory: 8 GB DDR3 Free Lifetime Technical Support CybertronPC Borg-Q could be the most popular gaming desktop under $500 in 2016. The price was so wonderful for its ability as a ready-to-go desktop. Thanks to NVIDIA GeForce GT610 and 8GB memory, it would run most of recent released games with clear, vibrant graphics. 2.CybertronPC Electrum QS-A6 Price: $439 CPU: AMD A6-7400K 3.50GHz Dual-Core Graphics: AMD Radeon R5 GPU Hard Drive: 1000 GB SATA II Memory: 16 GB DDR3 Free Lifetime Technical Support Another Cybertron PC with great performance and low cost. 16GB memory and AMD Radeon R5 are the biggest selling points. This computer is definitely starting point to PC gaming. 3.Alienware Steam Machine ASM100-6980BLK Price: $462 CPU: 2.2 GHz Intel Core i7 Graphics: Nvidia GeForce GTX GPU Hard Drive: 1GB SATA Memory: 8 GB DDR3L SDRAM This is not a general purpose PC, it is designed for huge gamers powered by Steam, and every Alienware Steam Machine includes free games as well as exclusive downloadable content for Alienware customers. 4.Lenovo Ideacentre Price: $499 CPU: Intel Quad-Core i5-4460s Graphics: Intel HD graphics 4600 Hard Drive: 2-in-1 hybrid hard drive 2TB 7200 rpm SATA Hard Drive + 8GB Solid State Drive Memory: 16GB DDR3L 1600MHz SDRAM Although Lenovo Ideacentre comes with a less performance graphics card which compared to previous PCs, the 8GB SSD and Quad-Core CPU would handle most of games without a blink. 5.CybertronPC Electrum QS-GT7 Price: $479 CPU: AMD FX-4300 3.80GHz Quad-Core Graphics: Nvidia GeForce GT 730 Hard Drive: 1000 GB SATA II Memory: 8 GB DDR3 Lifetime Technical Support If you are a gamer but not always play most recent games, this computer would exceed your expectations. It could run most of popular online games (WoW, StarCraft, Overwatch etc) in full graphic settings smoothly.","categories":[],"tags":[{"name":"Desktop","slug":"Desktop","permalink":"https://cheeper.io/blog/tags/Desktop/"},{"name":"Gaming","slug":"Gaming","permalink":"https://cheeper.io/blog/tags/Gaming/"},{"name":"Alienware","slug":"Alienware","permalink":"https://cheeper.io/blog/tags/Alienware/"},{"name":"Lenovo","slug":"Lenovo","permalink":"https://cheeper.io/blog/tags/Lenovo/"},{"name":"CybertronPC","slug":"CybertronPC","permalink":"https://cheeper.io/blog/tags/CybertronPC/"}]},{"title":"Google Pixel Reviews","slug":"google-pixel-reviews","date":"2017-01-20T00:32:32.000Z","updated":"2017-01-24T13:34:15.271Z","comments":true,"path":"2017/google-pixel-reviews/","link":"","permalink":"https://cheeper.io/blog/blog/2017/google-pixel-reviews/","excerpt":"For many cell phone enthusiasts, Nexus phone has been a belief-like existence: high perfomance with low-cost, authentic Android experience, all of these make Nexus a must-have phone in Android’s world.","text":"For many cell phone enthusiasts, Nexus phone has been a belief-like existence: high perfomance with low-cost, authentic Android experience, all of these make Nexus a must-have phone in Android’s world. However, all this eventually become memories - Google decided end the Nexus series on 2016, and created new signature series and named it Pixel. Prior to the Nexus phone has been the foundry to provide design solutions, Google is responsible for changes and additions, so we can find the Nexus phone on behalf of the various foundries.This year’s Pixel mobile phone designed entirely by Google itself, on behalf of the industry is only responsible for the production and assembly of HTC, which is very similar to the relationship between Apple and Foxconn. This time you can only find one capital “G” on the back of pixel phone, and no traces of the foundry, which also marks Google officially enter cellphone hardware industry. Pixel / Pixel XL are equipped with: Snapdragon 821 CPU 4GB memory 12.3 million pixel camera 32GB/128GB storage And Google Pixel has 5-inch 1080P screen and 2770mAh battery; On the other hand Pixel XL has 5.5-inch 2K screen and 3450mAh battery. Both support fast charge, and Google marketing them for 15 minutes charging can use 7 hours. On Google Store, the official price of Pixel was from $649 with free shipping. On Amazon, the price was from $550, and you could check a full price comparison list on our website","categories":[],"tags":[{"name":"Google","slug":"Google","permalink":"https://cheeper.io/blog/tags/Google/"},{"name":"Pixel","slug":"Pixel","permalink":"https://cheeper.io/blog/tags/Pixel/"},{"name":"cellphone","slug":"cellphone","permalink":"https://cheeper.io/blog/tags/cellphone/"}]}]}